michael-ring/mbf/Samples/templates/ATSAMD10D14A.svd
        <register>
          <name>CTRLA</name>
          <description>I2CS Control A</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <description>Operating Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>MODESelect</name>
                <enumeratedValue>
                  <name>USART_EXT_CLK</name>
                  <description>USART mode with external clock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART_INT_CLK</name>
                  <description>USART mode with internal clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI_SLAVE</name>
                  <description>SPI mode with external clock</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI_MASTER</name>
                  <description>SPI mode with internal clock</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_SLAVE</name>
                  <description>I2C mode with external clock</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_MASTER</name>
                  <description>I2C mode with internal clock</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run during Standby</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PINOUT</name>
              <description>Pin Usage</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDAHOLD</name>
              <description>SDA Hold Time</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SEXTTOEN</name>
              <description>Slave SCL Low Extend Timeout</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPEED</name>
              <description>Transfer Speed</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SCLSM</name>
              <description>SCL Clock Stretch Mode</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOWTOUTEN</name>
              <description>SCL Low Timeout Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLB</name>
          <description>I2CS Control B</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SMEN</name>
              <description>Smart Mode Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GCMD</name>
              <description>PMBus Group Command</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AACKEN</name>
              <description>Automatic Address Acknowledge</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMODE</name>
              <description>Address Mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CMD</name>
              <description>Command</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ACKACT</name>
              <description>Acknowledge Action</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA</name>
          <description>I2CS Data</description>
          <addressOffset>0x28</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>I2CS Interrupt Enable Clear</description>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PREC</name>
              <description>Stop Received Interrupt Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMATCH</name>
              <description>Address Match Interrupt Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DRDY</name>
              <description>Data Interrupt Disable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERROR</name>
              <description>Combined Error Interrupt Disable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>I2CS Interrupt Enable Set</description>
          <addressOffset>0x16</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PREC</name>
              <description>Stop Received Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMATCH</name>
              <description>Address Match Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DRDY</name>
              <description>Data Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERROR</name>
              <description>Combined Error Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAG</name>
          <description>I2CS Interrupt Flag Status and Clear</description>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PREC</name>
              <description>Stop Received Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMATCH</name>
              <description>Address Match Interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DRDY</name>
              <description>Data Interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERROR</name>
              <description>Combined Error Interrupt</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>I2CS Status</description>
          <addressOffset>0x1A</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>BUSERR</name>
              <description>Bus Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COLL</name>
              <description>Transmit Collision</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXNACK</name>
              <description>Received Not Acknowledge</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIR</name>
              <description>Read/Write Direction</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SR</name>
              <description>Repeated Start</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOWTOUT</name>
              <description>SCL Low Timeout</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLKHOLD</name>
              <description>Clock Hold</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEXTTOUT</name>
              <description>Slave SCL Low Extend Timeout</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HS</name>
              <description>High Speed</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCBUSY</name>
          <description>I2CS Syncbusy</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset Synchronization Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>SERCOM Enable Synchronization Busy</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
